[
  {
    "id": "P001",
    "category": "infrastructure",
    "description": "Create SQLite bootstrap and todos table with required MVP columns.",
    "steps": [
      "Add database initialization on server start.",
      "Create todos table if it does not exist with: id, title, category, group_name, completed, created_at.",
      "Store database file locally in project workspace."
    ],
    "validation": [
      "Start the app and verify startup completes without SQL errors.",
      "Query schema and confirm todos table includes all required columns.",
      "Restart app and confirm database file remains present."
    ],
    "passes": true,
    "notes": "Implemented SQLite bootstrap in src/db.js and startup initialization in src/server.js. Validated startup, schema columns, and DB file persistence across restart on 2026-02-16."
  },
  {
    "id": "P002",
    "category": "functional",
    "description": "Implement POST endpoint to create a TODO with title, category, and group.",
    "steps": [
      "Add POST /api/todos route.",
      "Validate title is non-empty.",
      "Insert row with completed=false and created_at timestamp, then return created record."
    ],
    "validation": [
      "POST valid payload returns 201 with id and persisted fields.",
      "POST with empty title returns 400.",
      "Database contains the new row after request."
    ],
    "passes": true,
    "notes": "Implemented POST /api/todos in src/server.js with non-empty title validation, DB insert (completed=0), and created-row response payload. Validated 201/400 outcomes and DB persistence via handler-level invocation on 2026-02-16 (sandbox blocks local port binding)."
  },
  {
    "id": "P003",
    "category": "quality",
    "description": "Add automated test for TODO creation API.",
    "steps": [
      "Add one test that posts a valid todo and asserts 201 response shape.",
      "Add one test that posts invalid title and asserts 400.",
      "Ensure test uses isolated test database state."
    ],
    "validation": [
      "Run test command and confirm create endpoint tests pass.",
      "Confirm failing behavior if title validation is removed.",
      "Confirm tests do not depend on existing local data."
    ],
    "passes": true,
    "notes": "Added automated tests in tests/p003-create-todo.test.js for valid and invalid POST /api/todos behavior using isolated test DB at tmp/p003-create.sqlite via TODO_DB_PATH. Validated with npm test on 2026-02-16."
  },
  {
    "id": "P004",
    "category": "functional",
    "description": "Implement GET endpoint to list TODOs.",
    "steps": [
      "Add GET /api/todos route.",
      "Return todos with id, title, category, group_name, completed, created_at.",
      "Sort newest first by created_at."
    ],
    "validation": [
      "GET returns 200 and JSON array.",
      "After creating todos, GET includes them with expected fields.",
      "Response ordering is newest first."
    ],
    "passes": true,
    "notes": "Implemented GET /api/todos in src/server.js returning id, title, category, group_name, completed, and created_at sorted newest-first by created_at (with id tie-breaker). Validated 200 JSON array response, field shape after creating todos, and newest-first ordering via handler-level invocation on 2026-02-16 (sandbox blocks local port binding)."
  },
  {
    "id": "P005",
    "category": "quality",
    "description": "Add automated test for TODO listing API.",
    "steps": [
      "Seed two todos in test setup.",
      "Call GET /api/todos and assert both items are returned.",
      "Assert response includes required fields and expected sort order."
    ],
    "validation": [
      "Run test command and confirm list endpoint tests pass.",
      "Confirm test fails if sorting is reversed.",
      "Confirm test uses isolated database state."
    ],
    "passes": true,
    "notes": "Added tests/p005-list-todos.test.js with isolated DB path (tmp/p005-list.sqlite), seeded two todos in setup, and asserted GET /api/todos returns required fields in newest-first order. Validated with node --test target run, npm test, and a negative mutation-style assertion that intentionally expected reversed order (failed as expected) on 2026-02-16."
  },
  {
    "id": "P006",
    "category": "functional",
    "description": "Implement endpoint to toggle TODO completion state.",
    "steps": [
      "Add PATCH /api/todos/:id/toggle route.",
      "Flip completed value for the targeted todo.",
      "Return updated todo and 404 for missing id."
    ],
    "validation": [
      "PATCH toggles false->true and true->false on repeated calls.",
      "PATCH returns 404 for unknown id.",
      "Database row reflects toggled state after request."
    ],
    "passes": true,
    "notes": "Implemented PATCH /api/todos/:id/toggle in src/server.js with completed-state flip using SQL CASE update, 200 updated-row response, and 404 for missing/invalid ids. Validated false->true->false behavior plus persisted DB state and unknown-id 404 via isolated handler-level run on 2026-02-16; regression suite passes."
  },
  {
    "id": "P007",
    "category": "quality",
    "description": "Add automated test for completion toggle API.",
    "steps": [
      "Create one todo in setup.",
      "Call toggle endpoint twice and assert state flips each time.",
      "Assert 404 behavior for nonexistent id."
    ],
    "validation": [
      "Run test command and confirm toggle tests pass.",
      "Confirm test fails if endpoint always sets completed=true.",
      "Confirm updated state is persisted in database assertions."
    ],
    "passes": true,
    "notes": "Added tests/p007-toggle-todo.test.js with isolated DB path (tmp/p007-toggle.sqlite), seeded one todo in setup, asserted PATCH toggle flips false->true->false across two calls with DB persistence checks, and asserted 404 for nonexistent id. Validated with targeted and full test runs plus a mutation-style negative assertion that intentionally expected always-true behavior (failed as expected) on 2026-02-16."
  },
  {
    "id": "P008",
    "category": "functional",
    "description": "Implement endpoint to delete a TODO.",
    "steps": [
      "Add DELETE /api/todos/:id route.",
      "Delete targeted row and return 204.",
      "Return 404 when id does not exist."
    ],
    "validation": [
      "DELETE existing id returns 204.",
      "Subsequent GET no longer includes deleted todo.",
      "DELETE unknown id returns 404."
    ],
    "passes": true,
    "notes": "Implemented DELETE /api/todos/:id in src/server.js with 204 for successful deletion and 404 for missing/invalid ids. Validated delete success, post-delete absence from GET and DB row, and unknown-id 404 via isolated handler-level flow on 2026-02-16; regression suite passes."
  },
  {
    "id": "P009",
    "category": "quality",
    "description": "Add automated test for delete API.",
    "steps": [
      "Seed one todo in setup.",
      "Call DELETE and assert 204 then verify absence via GET or DB query.",
      "Assert 404 for deleting unknown id."
    ],
    "validation": [
      "Run test command and confirm delete tests pass.",
      "Confirm test fails if endpoint returns success without removing row.",
      "Confirm deletion is persisted across app restart in integration flow."
    ],
    "passes": true,
    "notes": "Added tests/p009-delete-todo.test.js with isolated DB path (tmp/p009-delete.sqlite), seeded one todo in setup, asserted DELETE returns 204 and removal via GET/DB query, asserted 404 for unknown id, and validated deletion persistence after simulated app restart via server module reload. Validated with targeted and full test runs plus a mutation-style negative assertion that intentionally expected deleted row presence (failed as expected) on 2026-02-16."
  },
  {
    "id": "P010",
    "category": "functional",
    "description": "Serve a minimal browser UI shell for creating and listing TODOs.",
    "steps": [
      "Serve a single HTML page and static assets from the app.",
      "Add form inputs for title, category, and group.",
      "Render todo list from GET /api/todos on load."
    ],
    "validation": [
      "Open app in browser and confirm page loads without JS errors.",
      "Submitting form creates todo and it appears in list without reload.",
      "Empty list shows an explicit empty state message."
    ],
    "passes": true,
    "notes": "Implemented minimal browser UI shell via src/public/index.html, src/public/app.js, and src/public/styles.css, and added static serving in src/server.js for / and /static/* while keeping API routes intact. Validated page/static delivery, create/list API-backed flow, and explicit empty state rendering hooks with isolated handler-level checks plus full test suite on 2026-02-16."
  },
  {
    "id": "P011",
    "category": "functional",
    "description": "Add UI actions to toggle complete and delete TODOs.",
    "steps": [
      "Add toggle control per todo item wired to PATCH endpoint.",
      "Add delete control per todo item wired to DELETE endpoint.",
      "Update UI state immediately after each action."
    ],
    "validation": [
      "Clicking toggle changes visual state and persists after page refresh.",
      "Clicking delete removes item and it does not return after refresh.",
      "UI remains consistent when API returns 404 for stale item ids."
    ],
    "passes": true,
    "notes": "Implemented UI toggle/delete actions in src/public/app.js with per-item controls wired to PATCH /api/todos/:id/toggle and DELETE /api/todos/:id, immediate optimistic UI updates, and stale-id (404) recovery via list refresh + message. Added matching control styling in src/public/styles.css. Validated with npm test and a mocked DOM/fetch interaction script confirming immediate toggle visual update, delete flow, and 404 consistency handling on 2026-02-16."
  },
  {
    "id": "P012",
    "category": "functional",
    "description": "Add basic group/category view controls to manage TODOs by grouping.",
    "steps": [
      "Add simple filter or grouping controls for category and group.",
      "Apply controls to displayed list client-side or server-side.",
      "Show current active filter/group context in the UI."
    ],
    "validation": [
      "Selecting a category shows only matching todos.",
      "Selecting a group shows only matching todos.",
      "Clearing controls restores full list."
    ],
    "passes": true,
    "notes": "Implemented basic client-side category/group filtering controls in src/public/index.html and src/public/app.js, including active filter context text and clear-filters action. Updated rendering to show only matching todos and explicit filtered empty state. Validated filter-by-category, filter-by-group, and clear behavior via targeted app.js harness script, and ran full regression suite with npm test on 2026-02-16."
  },
  {
    "id": "P013",
    "category": "quality",
    "description": "Document local run and test commands in README for MVP quality gate.",
    "steps": [
      "Add setup prerequisites section.",
      "Add exact commands to start app locally.",
      "Add exact command to run automated tests."
    ],
    "validation": [
      "Follow README from a clean clone and start app successfully.",
      "Follow README and run tests successfully.",
      "Commands are copy-pasteable and match package scripts."
    ],
    "passes": true,
    "notes": "Added README.md with prerequisites and exact local run/test commands (npm install, npm run start, npm test). Validated npm test passes and README commands align with package scripts on 2026-02-16; direct startup execution in this sandbox is blocked by listen EPERM."
  },
  {
    "id": "P014",
    "category": "quality",
    "description": "Add a single smoke test that verifies local persistence across restart.",
    "steps": [
      "Create a smoke test flow: create todo, stop app, restart app, list todos.",
      "Assert created todo remains present after restart.",
      "Document any test fixture cleanup needed for repeatability."
    ],
    "validation": [
      "Smoke test passes on local machine.",
      "Smoke test fails if database uses in-memory mode.",
      "Test can be rerun without manual database edits."
    ],
    "passes": true,
    "notes": "Added tests/p014-persistence-smoke.test.js implementing a restart smoke flow (POST create -> simulated module restart -> GET list) against isolated DB tmp/p014-persistence.sqlite, with beforeEach cleanup (table + sqlite_sequence reset) for repeatability. Validated targeted smoke run and full suite via node --test tests/p014-persistence-smoke.test.js and npm test. Verified non-persistent mutation fails the persistence assertion with a two-DB restart script on 2026-02-16."
  }
]
